openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Pwm.c
/* -------------------------------- Arctic Core ------------------------------
 * Arctic Core - the open source AUTOSAR platform http://arccore.com
 *
 * Copyright (C) 2009  ArcCore AB <contact@arccore.com>
 *
 * This source code is free software; you can redistribute it and/or modify it
 * under the terms of the GNU General Public License version 2 as published by the
 * Free Software Foundation; See <http://www.gnu.org/licenses/old-licenses/gpl-2.0.txt>.
 *
 * This program is distributed in the hope that it will be useful, but
 * WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY
 * or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License
 * for more details.
 * -------------------------------- Arctic Core ------------------------------*/








/*
 * Pwm.c
 *
 * TODO: Implement DMA support for PWM
 * TODO: Test PWM for MPC5567 and MPC5554
 *
 *  Created on: 2009-jul-09
 *      Author: nian
 */


#include <assert.h>
#include <string.h>

#include "Pwm.h"
#include "MemMap.h"
//#include "SchM_Pwm.h"
#include "Det.h"

#include "mpc55xx.h"

#include "Os.h"
#include "Mcu.h"
#if PWM_NOTIFICATION_SUPPORTED==STD_ON
#include "isr.h"
#include "irq.h"
#include "arc.h"
#endif

#if defined(CFG_MPC5606S)
	#define PWM_RUNTIME_CHANNEL_COUNT	48
    #define CHANNELS_OK (((Channel <= PWM_MAX_CHANNEL-1) && (Channel >= 40)) || ((Channel <= 23) && (Channel >= 16)))
#else
	#define PWM_RUNTIME_CHANNEL_COUNT	16
	#define CHANNELS_OK (Channel < 16)
#endif

const Pwm_ConfigType* PwmConfigPtr = NULL;

typedef enum {
	PWM_STATE_UNINITIALIZED, PWM_STATE_INITIALIZED
} Pwm_ModuleStateType;

static Pwm_ModuleStateType Pwm_ModuleState = PWM_STATE_UNINITIALIZED;

// Run-time variables
typedef struct {
	Pwm_ChannelClassType Class;

	#if PWM_NOTIFICATION_SUPPORTED==STD_ON
		Pwm_NotificationHandlerType NotificationRoutine;
		Pwm_EdgeNotificationType NotificationState;
	#endif
} Pwm_ChannelStructType;

// We use Pwm_ChannelType as index here
Pwm_ChannelStructType ChannelRuntimeStruct[PWM_RUNTIME_CHANNEL_COUNT];


/* Local functions */
Std_ReturnType Pwm_ValidateInitialized(Pwm_APIServiceIDType apiId)
{
	Std_ReturnType result = E_OK;
    if( Pwm_ModuleState == PWM_STATE_UNINITIALIZED )
    {
#if PWM_DEV_ERROR_DETECT==STD_ON
    	Det_ReportError(PWM_MODULE_ID,0, apiId,PWM_E_UNINIT);
    	result = E_NOT_OK;
#endif
    }
    return result;
}

Std_ReturnType Pwm_ValidateChannel(Pwm_ChannelType Channel,Pwm_APIServiceIDType apiId)
{
	Std_ReturnType result = E_OK;
    if( !CHANNELS_OK  )
    {
#if PWM_DEV_ERROR_DETECT==STD_ON
    	Det_ReportError(PWM_MODULE_ID,0, apiId,PWM_E_PARAM_CHANNEL);
    	result = E_NOT_OK;
#endif
    }
    return result;
}

void inline Pwm_InitChannel(Pwm_ChannelType Channel);
void inline Pwm_DeInitChannel(Pwm_ChannelType Channel);

#if PWM_NOTIFICATION_SUPPORTED==STD_ON
static void Pwm_Isr(void);
#endif

static void calcPeriodTicksAndPrescaler(
				const Pwm_ChannelConfigurationType* channelConfig,
				uint16_t* ticks, Pwm_ChannelPrescalerType* prescaler) {

	Pwm_ChannelType channel = channelConfig->channel;
	uint32_t pre_global = 0;
	uint32_t f_in = 0;

#if defined(CFG_MPC5606S)
	if(channel <= PWM_NUMBER_OF_EACH_EMIOS-1) {
		f_in = McuE_GetPeripheralClock( PERIPHERAL_CLOCK_EMIOS_0 );
		pre_global = EMIOS_0.MCR.B.GPRE;
	} else {
		f_in = McuE_GetPeripheralClock( PERIPHERAL_CLOCK_EMIOS_1 );
		pre_global = EMIOS_1.MCR.B.GPRE;
	}
#else
	f_in = McuE_GetPeripheralClock( PERIPHERAL_CLOCK_EMIOS );
	pre_global = EMIOS.MCR.B.GPRE;
#endif

  uint32_t f_target = channelConfig->frequency;

  Pwm_ChannelPrescalerType pre;
  uint32_t ticks_temp;

  if (channelConfig->prescaler == PWM_CHANNEL_PRESCALER_AUTO) {
    // Go from lowest to highest prescaler
    for (pre = PWM_CHANNEL_PRESCALER_1; pre < PWM_CHANNEL_PRESCALER_4; ++pre) {
      ticks_temp = f_in / (f_target * (pre_global + 1) * (pre + 1)); // Calc ticks
      if (ticks_temp > 0xffff) {
        ticks_temp = 0xffff;  // Prescaler too low
      } else {
        break;                // Prescaler ok
      }
    }
  } else {
    pre = channelConfig->prescaler; // Use config setting
    ticks_temp = f_in / (f_target * pre_global * (pre+1)); // Calc ticks
    if (ticks_temp > 0xffff) {
      ticks_temp = 0xffff;  // Prescaler too low
    }
  }

  (*ticks) = (uint16_t) ticks_temp;
  (*prescaler) = pre;
}


static void configureChannel(Pwm_ChannelType channel_iterator, const Pwm_ChannelConfigurationType* channelConfig, const Pwm_ConfigType* ConfigPtr){

	Pwm_ChannelType channel = channelConfig->channel;

	#if defined(CFG_MPC5606S)
		volatile struct EMIOS_tag *emiosHw;
		if(channel <= PWM_NUMBER_OF_EACH_EMIOS-1) {
			emiosHw = &EMIOS_0;
		} else {
			emiosHw = &EMIOS_1;
		}

		ChannelRuntimeStruct[channel].Class = ConfigPtr->ChannelClass[channel_iterator];

		emiosHw->CH[channel].CCR.B.MODE = PWM_EMIOS_OPWM;
		emiosHw->CH[channel].CCR.B.DMA = 0;
		emiosHw->CH[channel].CCR.B.BSL = 3;
		emiosHw->CH[channel].CCR.B.ODIS = 0;

		Pwm_ChannelPrescalerType prescaler;  uint16_t period_ticks;
		calcPeriodTicksAndPrescaler( channelConfig, &period_ticks, &prescaler );

		emiosHw->CH[channel].CBDR.R = period_ticks;
		emiosHw->CH[channel].CCR.B.UCPRE = prescaler;
		emiosHw->CH[channel].CCR.B.UCPEN = 1;

		// 0 A match on comparator A clears the output flip-flop, while a match on comparator B sets it
		// 1 A match on comparator A sets the output flip-flop, while a match on comparator B clears it
		// A duty cycle of X % should give a signal with state 'channelConfig->polarity' during
		// X % of the period time.
		emiosHw->CH[channel].CCR.B.EDPOL = (channelConfig->polarity == PWM_LOW) ? 1 : 0;

		#if PWM_SET_PERIOD_AND_DUTY==STD_ON
			ChannelRuntimeStruct[channel].Class = ConfigPtr->ChannelClass[channel_iterator];
		#endif

	#else

		EMIOS.CH[channel].CCR.B.MODE = PWM_EMIOS_OPWM;
		EMIOS.CH[channel].CCR.B.DMA = 0;
		EMIOS.CH[channel].CCR.B.BSL = 3;
		EMIOS.CH[channel].CCR.B.ODIS = 0;

		Pwm_ChannelPrescalerType prescaler;  uint16_t period_ticks;
		calcPeriodTicksAndPrescaler( channelConfig, &period_ticks, &prescaler );

